of-project-2/Re-20/radial-refinement/coarse/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cell;

fields          ( p U );

setFormat       raw;

sets
(
    piover4
    {
        type    lineCell;
        axis    xyz;
        start   ( 0.0 0.0 0.00);
        end     ( 5.85 6.0 0.00);
    }

    piover2
    {
        type    lineCell;
        axis    xyz;
        start   ( 0.0 0.0 0.00);
        end     ( 0.0 8.49 0.00);
    }

    threepiover4
    {
        type    lineCell;
        axis    xyz;
        start   ( 0.0 0.0 0.0);
        end     ( -5.85 6.0 0.0);

    }
);

// ************************************************************************* //
